#### ImportUnit Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible target units for CAD Import.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ImportUnit ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ImportUnit ``` |

| Visual C++ |
| --- |
| ``` public enum class ImportUnit ``` |

# Members

| Member name | Description |
| --- | --- |
| Default | Unit (if available) from the document that is getting imported. |
| Foot | Feet and Inches in fractional notation. |
| Inch | Inches in fractional notation. |
| Meter | Meters as decimal values. |
| Decimeter | Decimeters as decimal values. |
| Centimeter | Centimeters as decimal values. |
| Millimeter | Millimeters as decimal values. |
| Custom | Custom values as decimal values |

# See Also

Autodesk.Revit.DB Namespace